БухЭксп/InformationRegisters/ДокументыНДФЛАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыНДФЛАУСН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасчетовНДФЛАУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Comment>Текст ответа ФНС при получении статуса FAILED</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИсходящегоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВходящегоЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/РасчетыНДФЛАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыНДФЛАУСН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеоблагаемаяВзносами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛУдержаный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛПеречисленный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДФЛНерезидента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерУведомленияНерезидента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУведомленияНерезидента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаНерезидента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтправитьВБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНеоблагаемогоВзносамиДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/СтатусыРасчетовНДФЛАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРасчетовНДФЛАУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриОтправке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/ДокументыНДФЛАУСН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает описание реквизитов документа НДФЛ
//
// Параметры:
//  Документ - ДокументСсылка.СписаниеСРасчетногоСчета - ссылка на документ
//  Организация - СправочникСсылка.Организации - организация документа
//
// Возвращаемое значение:
//  Структура:
//   * Документ - ДокументСсылка.СписаниеСРасчетногоСчета - ссылка на документ
//   * Организация - СправочникСсылка.Организации - организация документа
//   * Идентификатор - Строка - идентификатор документа
//   * Статус - ПеречислениеСсылка.СтатусыРасчетовНДФЛАУСН - статус документа
//   * ТекстОшибки - Строка - текст ошибки из входящего запроса РасчетНДФЛ сервсиса
//   * ИдентификаторИсходящегоЗапроса - Строка - идентификатор исходящего запроса РасчетНДФЛ сервиса
//   * ИдентификаторВходящегоЗапроса - Строка - идентификатор входящего запроса РасчетНДФЛ сервиса
//   * ДатаДокумента - дата документа
//
Функция НовыйРеквизитыДокумента(Документ, Организация) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Документ", Документ);
	ПараметрыЗапроса.Вставить("Организация", Организация);
	ПараметрыЗапроса.Вставить("Идентификатор", "");
	ПараметрыЗапроса.Вставить("Статус", Перечисления.СтатусыРасчетовНДФЛАУСН.ПустаяСсылка());
	ПараметрыЗапроса.Вставить("ТекстОшибки", "");
	ПараметрыЗапроса.Вставить("ИдентификаторИсходящегоЗапроса", "");
	ПараметрыЗапроса.Вставить("ИдентификаторВходящегоЗапроса", "");
	ПараметрыЗапроса.Вставить("ДатаДокумента", '00010101');
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Создает или изменяет запись в регистре по переданным реквизитам документа НДФЛ
//
// Параметры:
//  РеквизитыДокумента - Структура - см. НовыйРеквизитыДокумента()
//
Процедура ИзменитьДокумент(РеквизитыДокумента) Экспорт
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(РеквизитыДокумента.Документ);
	Запись = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, РеквизитыДокумента);
	Набор.Записать();
	
КонецПроцедуры

// Возвращает значения измерений, ресурсов и реквизитов записи, устанавливая отбор в зависимости от переданных
// параметров
//
// Параметры:
//  Документ - ДокументСсылка.СписаниеСРасчетногоСчета, Неопределено -
//             заполняется, если требуется отбор по значению измерения Документ
//  Идентификатор - Строка, Неопределено - заполняется, если требуется отбор по значению ресурса Идентификатор
//
// Возвращаемое значение:
//  Структура - см. НовыйРеквизитыДокумента - реквизиты документа
//  Неопределено - в случае, если не переданы параметры отбора или нет записи о документе в регистре
//
Функция ДанныеДокумента(Документ = Неопределено, Идентификатор = Неопределено) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыНДФЛАУСН.Организация КАК Организация,
		|	ДокументыНДФЛАУСН.Документ КАК Документ,
		|	ДокументыНДФЛАУСН.Идентификатор КАК Идентификатор,
		|	ДокументыНДФЛАУСН.Статус КАК Статус,
		|	ДокументыНДФЛАУСН.ТекстОшибки КАК ТекстОшибки,
		|	ДокументыНДФЛАУСН.ИдентификаторИсходящегоЗапроса КАК ИдентификаторИсходящегоЗапроса,
		|	ДокументыНДФЛАУСН.ИдентификаторВходящегоЗапроса КАК ИдентификаторВходящегоЗапроса,
		|	СписаниеСРасчетногоСчета.Дата КАК ДатаДокумента
		|ИЗ
		|	РегистрСведений.ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ПО ДокументыНДФЛАУСН.Документ = СписаниеСРасчетногоСчета.Ссылка";
	
	СхемаЗапроса = СхемыЗапросов.Создать(ТекстЗапроса);
	ТочкаЗапроса = СхемыЗапросов.НайтиТаблицуПоПсевдониму(СхемаЗапроса, "ДокументыНДФЛАУСН");
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(Документ) Тогда
		ТочкаЗапроса.Оператор.Отбор.Добавить("ДокументыНДФЛАУСН.Документ = &Документ");
		Запрос.УстановитьПараметр("Документ", Документ);
	ИначеЕсли ЗначениеЗаполнено(Идентификатор) Тогда
		ТочкаЗапроса.Оператор.Отбор.Добавить("ДокументыНДФЛАУСН.Идентификатор = &Идентификатор");
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыДокумента = НовыйРеквизитыДокумента(Выборка.Документ, Выборка.Организация);
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Выборка);
		Возврат РеквизитыДокумента;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьДокументНДФЛАУСНПередЗаписью(ДокументОбъект, Отказ, РежимЗаписи) Экспорт
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ЭтоНовыйДокументНДФЛАУСН", ДокументОбъект.ЭтоНовый());
	ДокументОбъект.ДополнительныеСвойства.Вставить("РежимЗаписиДокументаНДФЛАУСН", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбновитьДокументНДФЛАУСНПриЗаписи(ДокументОбъект, Отказ) Экспорт
	
	ЭтоНовыйДокументНДФЛАУСН = ДокументОбъект.ДополнительныеСвойства.ЭтоНовыйДокументНДФЛАУСН;
	РежимЗаписиДокументаНДФЛАУСН = ДокументОбъект.ДополнительныеСвойства.РежимЗаписиДокументаНДФЛАУСН;
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыНДФЛАУСН");
		ЭлементБлокировкиДанных.УстановитьЗначение("Документ", ДокументОбъект.Ссылка);
		БлокировкаДанных.Заблокировать();
		
		ЭтоДокументНДФЛАУСН = Не ДокументОбъект.ПометкаУдаления
			И Документы.СписаниеСРасчетногоСчета.ЭтоОперацияРасчетаНДФЛАУСН(ДокументОбъект);
		
		Если ЭтоДокументНДФЛАУСН И УчетнаяПолитика.ПрименяетсяАУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
			Если РежимЗаписиДокументаНДФЛАУСН = РежимЗаписиДокумента.ОтменаПроведения Тогда
				ДобавитьПустуюЗапись(ДокументОбъект.Ссылка, ДокументОбъект.Организация);
			Иначе
				РеквизитыДокумента = ДанныеДокумента(ДокументОбъект.Ссылка);
				Если РеквизитыДокумента = Неопределено Или РеквизитыДокумента.Организация <> ДокументОбъект.Организация Тогда
					ДобавитьПустуюЗапись(ДокументОбъект.Ссылка, ДокументОбъект.Организация);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Не ЭтоНовыйДокументНДФЛАУСН Тогда
			УдалитьЗапись(ДокументОбъект.Ссылка);
		КонецЕсли;
	Исключение
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось записать расчет НДФЛ АУСН по причине:
			|%1'"),
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьДокументНДФЛАУСНПриПроведенииРасчета(Документ, Отказ) Экспорт
	
	Ключи = ДанныеДокумента(Документ);
	Если Ключи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыНДФЛАУСН");
		ЭлементБлокировкиДанных.УстановитьЗначение("Документ", Документ);
		БлокировкаДанных.Заблокировать();
	
		ДатаПодключенияПередачиНДФЛ = РегистрыСведений.СостоянияИнтеграцииАУСН.ДатаПодключенияПередачиНДФЛ(Ключи.Организация);
		НастроенаПередачаНДФЛ = ЗначениеЗаполнено(ДатаПодключенияПередачиНДФЛ)
			И Ключи.ДатаДокумента >= ДатаПодключенияПередачиНДФЛ;
		
		РеквизитыДокумента = НовыйРеквизитыДокумента(Документ, Ключи.Организация);
		РеквизитыДокумента.Статус = ?(НастроенаПередачаНДФЛ,
			Перечисления.СтатусыРасчетовНДФЛАУСН.ОжидаетОтправки,
			Перечисления.СтатусыРасчетовНДФЛАУСН.ПустаяСсылка());
		ИзменитьДокумент(РеквизитыДокумента);
	Исключение
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось записать расчет НДФЛ АУСН по причине:
			|%1'"),
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Функция РасшифроватьВходящийЗапрос(ДанныеДокумента) Экспорт
	
	Возврат РасшифроватьЗапрос(ДанныеДокумента.ИдентификаторВходящегоЗапроса, "PostEmployeeInfoResponse");
	
КонецФункции

Функция РасшифроватьИсходящийЗапрос(ДанныеДокумента) Экспорт
	
	Возврат РасшифроватьЗапрос(ДанныеДокумента.ИдентификаторИсходящегоЗапроса, "PostEmployeeInfoRequest");
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Возвращает список методов, которые могут быть вызваны как произвольный код
// (для регламентных заданий и фоновых заданий)
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗаполнитьДокументыНДФЛАУСН");
	Методы.Вставить("ДозаполнитьДокументыНДФЛАУСН");
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом
// 
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПустуюЗапись(Документ, Организация)
	
	РеквизитыДокумента = НовыйРеквизитыДокумента(Документ, Организация);
	ИзменитьДокумент(РеквизитыДокумента);
	
КонецПроцедуры

Процедура УдалитьЗапись(Документ)
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ);
	Набор.Записать();
	
КонецПроцедуры

Функция РасшифроватьЗапрос(ИдентификаторЗапроса, ТипЗапроса)
	
	Если ПустаяСтрока(ИдентификаторЗапроса) Тогда
		Возврат "";
	КонецЕсли;
	
	ДокументАУСН = РегистрыСведений.ДокументыАУСН.НайтиДокументы(Неопределено,
		ИдентификаторЗапроса);
	Если ДокументАУСН.Следующий() Тогда
		КаталогРазбора = ФайловаяСистема.СоздатьВременныйКаталог("zip");
		ДанныеДокумента = ИнтеграцияАУСН.РасшифроватьДанныеДокумента(ДокументАУСН, КаталогРазбора);
		ФайловаяСистема.УдалитьВременныйКаталог(КаталогРазбора);
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку("UTF-8");
		ДанныеДокумента.Фабрика.ЗаписатьXML(ЗаписьXML, ДанныеДокумента.Ответ, ТипЗапроса);
		Возврат ЗаписьXML.Закрыть();
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки)
	
	ЗаписьЖурналаРегистрации(ИнтеграцияАУСНКлиентСервер.ИмяСобытияЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ДокументыНДФЛАУСН, , ТекстОшибки);
	
КонецПроцедуры

#Область ОбработчикиОбновления

Процедура ЗаполнитьДокументыНДФЛАУСН(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиСистемыНалогообложения.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
	|ГДЕ
	|	НастройкиСистемыНалогообложения.ПрименяетсяАУСН";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ОрганизацииАУСН = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Организация");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложения.ДатаИзменения КАК ДатаИзменения,
	|	НастройкиСистемыНалогообложения.Организация КАК Организация,
	|	НастройкиСистемыНалогообложения.ПрименяетсяАУСН КАК ПрименяетсяАУСН
	|ПОМЕСТИТЬ НастройкиСистемыНалогообложения
	|ИЗ
	|	РегистрСведений.НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
	|ГДЕ
	|	НастройкиСистемыНалогообложения.Организация В(&ОрганизацииАУСН)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
	|	ДокументСписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
	|	ДокументСписаниеСРасчетногоСчета.Организация КАК Организация,
	|	ДокументСписаниеСРасчетногоСчета.Дата КАК Дата
	|ПОМЕСТИТЬ ДокументыНДФЛ
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ДокументСписаниеСРасчетногоСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета.ПеречислениеЗаработнойПлаты КАК СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты
	|		ПО ДокументСписаниеСРасчетногоСчета.Ссылка = СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН
	|		ПО ДокументСписаниеСРасчетногоСчета.Ссылка = ДокументыНДФЛАУСН.Документ
	|ГДЕ
	|	НЕ ДокументСписаниеСРасчетногоСчета.ПометкаУдаления
	|	И ДокументСписаниеСРасчетногоСчета.Организация В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				НастройкиСистемыНалогообложения.Организация
	|			ИЗ
	|				НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
	|			ГДЕ
	|				НастройкиСистемыНалогообложения.ПрименяетсяАУСН)
	|	И ДокументыНДФЛАУСН.Идентификатор ЕСТЬ NULL
	|	И (ДокументСписаниеСРасчетногоСчета.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗаработнойПлатыРаботнику), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеСотрудникуПоДоговоруПодряда))
	|				И ДокументСписаниеСРасчетногоСчета.ПлатежнаяВедомость ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк
	|			ИЛИ ДокументСписаниеСРасчетногоСчета.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеЗП), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ПеречислениеСотрудникамПоДоговорамПодряда))
	|				И СписаниеСРасчетногоСчетаПеречислениеЗаработнойПлаты.Ведомость ССЫЛКА Документ.ВедомостьНаВыплатуЗарплатыВБанк)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыНДФЛ.Ссылка КАК Ссылка,
	|	ДокументыНДФЛ.Организация КАК Организация,
	|	ДокументыНДФЛ.Дата КАК Дата,
	|	МАКСИМУМ(ЕСТЬNULL(НастройкиСистемыНалогообложения.ДатаИзменения, ДАТАВРЕМЯ(1, 1, 1))) КАК НастройкиСистемыНалогообложенияДатаИзменения
	|ПОМЕСТИТЬ ДокументыНДФЛСрезПоследних
	|ИЗ
	|	ДокументыНДФЛ КАК ДокументыНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
	|		ПО ДокументыНДФЛ.Организация = НастройкиСистемыНалогообложения.Организация
	|			И ДокументыНДФЛ.Дата >= НастройкиСистемыНалогообложения.ДатаИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыНДФЛ.Ссылка,
	|	ДокументыНДФЛ.Дата,
	|	ДокументыНДФЛ.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыНДФЛСрезПоследних.Ссылка КАК Ссылка,
	|	ДокументыНДФЛСрезПоследних.Организация КАК Организация,
	|	ДокументыНДФЛСрезПоследних.Дата КАК Дата
	|ПОМЕСТИТЬ ДокументыНДФЛАУСН
	|ИЗ
	|	ДокументыНДФЛСрезПоследних КАК ДокументыНДФЛСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСистемыНалогообложения КАК НастройкиСистемыНалогообложения
	|		ПО ДокументыНДФЛСрезПоследних.НастройкиСистемыНалогообложенияДатаИзменения = НастройкиСистемыНалогообложения.ДатаИзменения
	|			И ДокументыНДФЛСрезПоследних.Организация = НастройкиСистемыНалогообложения.Организация
	|ГДЕ
	|	ЕСТЬNULL(НастройкиСистемыНалогообложения.ПрименяетсяАУСН, ЛОЖЬ) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыНДФЛСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиСистемыНалогообложения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНДФЛАУСН.Регистратор КАК Регистратор,
	|	МАКСИМУМ(РасчетыНДФЛАУСН.УдалитьОтправитьВБанк) КАК ОтправитьВСервис
	|ПОМЕСТИТЬ ОтправитьРасчетыВСервис
	|ИЗ
	|	РегистрНакопления.РасчетыНДФЛАУСН КАК РасчетыНДФЛАУСН
	|ГДЕ
	|	РасчетыНДФЛАУСН.Активность
	|	И РасчетыНДФЛАУСН.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыНДФЛАУСН.Ссылка
	|			ИЗ
	|				ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыНДФЛАУСН.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыНДФЛАУСН.Ссылка КАК Ссылка,
	|	ДокументыНДФЛАУСН.Организация КАК Организация,
	|	ДокументыНДФЛАУСН.Дата КАК Дата,
	|	ЕСТЬNULL(ОтправитьРасчетыВСервис.ОтправитьВСервис, ЛОЖЬ) КАК ОтправитьВСервис
	|ИЗ
	|	ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтправитьРасчетыВСервис КАК ОтправитьРасчетыВСервис
	|		ПО ДокументыНДФЛАУСН.Ссылка = ОтправитьРасчетыВСервис.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ОрганизацииАУСН", ОрганизацииАУСН);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	СоответствиеДатаПодключения = Новый Соответствие;
	СоответствиеБанкПередачиНДФЛ = Новый Соответствие;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.СписаниеСРасчетногоСчета");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыНДФЛАУСН");
			ЭлементБлокировкиДанных.УстановитьЗначение("Документ", Выборка.Ссылка);
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиСистемыНалогообложения");
			БлокировкаДанных.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка);
			НаборЗаписей.Прочитать();
			Если ЗначениеЗаполнено(НаборЗаписей.Количество()) Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			// После блокировки данных вид операции документа и применение АУСН проверяем заново,
			// чтобы не добавить лишнюю запись в регистр
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ЭтоДокументНДФЛАУСН = Не ДокументОбъект.ПометкаУдаления
				И Документы.СписаниеСРасчетногоСчета.ЭтоОперацияРасчетаНДФЛАУСН(ДокументОбъект);
			Если Не ЭтоДокументНДФЛАУСН
				Или Не УчетнаяПолитика.ПрименяетсяАУСН(ДокументОбъект.Организация, ДокументОбъект.Дата) Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Организация = ДокументОбъект.Организация;
			НоваяЗапись.Документ = Выборка.Ссылка;
			Если ДокументОбъект.Проведен Тогда
				ДатаПодключенияПередачиНДФЛ = СоответствиеДатаПодключения[ДокументОбъект.Организация];
				Если ДатаПодключенияПередачиНДФЛ = Неопределено Тогда
					ДатаПодключенияПередачиНДФЛ = РегистрыСведений.СостоянияИнтеграцииАУСН.ДатаПодключенияПередачиНДФЛ(
						ДокументОбъект.Организация);
					СоответствиеДатаПодключения[ДокументОбъект.Организация] = ?(ДатаПодключенияПередачиНДФЛ = Неопределено,
						Дата(1, 1, 1), ДатаПодключенияПередачиНДФЛ);
				КонецЕсли;
				Если ЗначениеЗаполнено(ДатаПодключенияПередачиНДФЛ) И ДокументОбъект.Дата >= ДатаПодключенияПередачиНДФЛ Тогда
					Если Выборка.ОтправитьВСервис Тогда
						НоваяЗапись.Статус = Перечисления.СтатусыРасчетовНДФЛАУСН.ОжидаетОтправки;
					Иначе
						БанкПередачиНДФЛИзПрограммы = СоответствиеБанкПередачиНДФЛ[ДокументОбъект.Организация];
						Если БанкПередачиНДФЛИзПрограммы = Неопределено Тогда
							БанкПередачиНДФЛИзПрограммы = РегистрыСведений.СостоянияИнтеграцииАУСН.БанкПередачиНДФЛИзПрограммы(
								ДокументОбъект.Организация);
							СоответствиеБанкПередачиНДФЛ[ДокументОбъект.Организация] = ?(БанкПередачиНДФЛИзПрограммы = Неопределено, 
								Справочники.КлассификаторБанков.ПустаяСсылка(), БанкПередачиНДФЛИзПрограммы);
						КонецЕсли;
						НоваяЗапись.Статус = ?(ЗначениеЗаполнено(БанкПередачиНДФЛИзПрограммы),
							Перечисления.СтатусыРасчетовНДФЛАУСН.ПереданВБанк, Перечисления.СтатусыРасчетовНДФЛАУСН.ПереданВФНС);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОтменитьТранзакцию();
			
			// Обработку проблемных данных пропускаем, так как приоритет имеют беспроблемные данные
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать документ НДФЛ АУСН: %1 по причине:
				|%2'"),
				Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ДокументыНДФЛАУСН,
				Выборка.Ссылка,
				ТекстСообщения);
			
		КонецПопытки;
	КонецЦикла;
	
	ИмяПроцедурыОбновления = НСтр("ru = 'РегистрыСведений.ДокументыНДФЛАУСН.ЗаполнитьДокументыНДФЛАУСН'");
	Если ПроблемныхОбъектов > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре %1 не удалось обработать документы:
				|в %2 из %3 возникли ошибки'"),
			ИмяПроцедурыОбновления,
			ПроблемныхОбъектов,
			ОбъектовОбработано);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли ОбъектовОбработано > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедура %1 обработала очередную порцию данных: %2 документов'"),
			ИмяПроцедурыОбновления,
			ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,,
			ТекстСообщения);
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьДокументыНДФЛАУСН(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	РасчетыНДФЛАУСН.Регистратор КАК Ссылка,
	|	ДокументСписаниеСРасчетногоСчета.Дата КАК Дата,
	|	МАКСИМУМ(РасчетыНДФЛАУСН.УдалитьОтправитьВБанк) КАК ОтправитьВСервис
	|ИЗ
	|	РегистрНакопления.РасчетыНДФЛАУСН КАК РасчетыНДФЛАУСН
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК ДокументСписаниеСРасчетногоСчета
	|		ПО РасчетыНДФЛАУСН.Регистратор = ДокументСписаниеСРасчетногоСчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыНДФЛАУСН КАК ДокументыНДФЛАУСН
	|		ПО РасчетыНДФЛАУСН.Регистратор = ДокументыНДФЛАУСН.Документ
	|ГДЕ
	|	РасчетыНДФЛАУСН.Активность
	|	И ДокументыНДФЛАУСН.Идентификатор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыНДФЛАУСН.Регистратор,
	|	ДокументСписаниеСРасчетногоСчета.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчика.ОбработкаЗавершена = Ложь;
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	СоответствиеДатаПодключения = Новый Соответствие;
	СоответствиеБанкПередачиНДФЛ = Новый Соответствие;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.СписаниеСРасчетногоСчета");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДокументыНДФЛАУСН");
			ЭлементБлокировкиДанных.УстановитьЗначение("Документ", Выборка.Ссылка);
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.РасчетыНДФЛАУСН.НаборЗаписей");
			ЭлементБлокировкиДанных.УстановитьЗначение("Регистратор", Выборка.Ссылка);
			БлокировкаДанных.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Ссылка);
			НаборЗаписей.Прочитать();
			Если ЗначениеЗаполнено(НаборЗаписей.Количество()) Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НаборЗаписейРасчетыНДФЛ = РегистрыНакопления.РасчетыНДФЛАУСН.СоздатьНаборЗаписей();
			НаборЗаписейРасчетыНДФЛ.Отбор.Регистратор.Установить(Выборка.Ссылка);
			НаборЗаписейРасчетыНДФЛ.Прочитать();
			
			ЭтоДокументНДФЛАУСН = ЗначениеЗаполнено(НаборЗаписейРасчетыНДФЛ.Количество());
			Если Не ЭтоДокументНДФЛАУСН Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Организация = ДокументОбъект.Организация;
			НоваяЗапись.Документ = Выборка.Ссылка;
			Если ДокументОбъект.Проведен Тогда
				ДатаПодключенияПередачиНДФЛ = СоответствиеДатаПодключения[ДокументОбъект.Организация];
				Если ДатаПодключенияПередачиНДФЛ = Неопределено Тогда
					ДатаПодключенияПередачиНДФЛ = РегистрыСведений.СостоянияИнтеграцииАУСН.ДатаПодключенияПередачиНДФЛ(
						ДокументОбъект.Организация);
					СоответствиеДатаПодключения[ДокументОбъект.Организация] = ?(ДатаПодключенияПередачиНДФЛ = Неопределено,
						Дата(1, 1, 1), ДатаПодключенияПередачиНДФЛ);
				КонецЕсли;
				Если ЗначениеЗаполнено(ДатаПодключенияПередачиНДФЛ) И ДокументОбъект.Дата >= ДатаПодключенияПередачиНДФЛ Тогда
					Если Выборка.ОтправитьВСервис Тогда
						НоваяЗапись.Статус = Перечисления.СтатусыРасчетовНДФЛАУСН.ОжидаетОтправки;
					Иначе
						БанкПередачиНДФЛИзПрограммы = СоответствиеБанкПередачиНДФЛ[ДокументОбъект.Организация];
						Если БанкПередачиНДФЛИзПрограммы = Неопределено Тогда
							БанкПередачиНДФЛИзПрограммы = РегистрыСведений.СостоянияИнтеграцииАУСН.БанкПередачиНДФЛИзПрограммы(
								ДокументОбъект.Организация);
							СоответствиеБанкПередачиНДФЛ[ДокументОбъект.Организация] = ?(БанкПередачиНДФЛИзПрограммы = Неопределено, 
								Справочники.КлассификаторБанков.ПустаяСсылка(), БанкПередачиНДФЛИзПрограммы);
						КонецЕсли;
						НоваяЗапись.Статус = ?(ЗначениеЗаполнено(БанкПередачиНДФЛИзПрограммы),
							Перечисления.СтатусыРасчетовНДФЛАУСН.ПереданВБанк, Перечисления.СтатусыРасчетовНДФЛАУСН.ПереданВФНС);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
		Исключение
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ОтменитьТранзакцию();
			
			// Обработку проблемных данных пропускаем, так как приоритет имеют беспроблемные данные
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать документ НДФЛ АУСН: %1 по причине:
				|%2'"),
				Выборка.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ДокументыНДФЛАУСН,
				Выборка.Ссылка,
				ТекстСообщения);
			
		КонецПопытки;
	КонецЦикла;
	
	ИмяПроцедурыОбновления = НСтр("ru = 'РегистрыСведений.ДокументыНДФЛАУСН.ДозаполнитьДокументыНДФЛАУСН'");
	Если ПроблемныхОбъектов > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедуре %1 не удалось обработать документы:
				|в %2 из %3 возникли ошибки'"),
			ИмяПроцедурыОбновления,
			ПроблемныхОбъектов,
			ОбъектовОбработано);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли ОбъектовОбработано > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Процедура %1 обработала очередную порцию данных: %2 документов'"),
			ИмяПроцедурыОбновления,
			ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			,,
			ТекстСообщения);
	Иначе
		ПараметрыОбработчика.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
